//================================================================================================================
//
// DirectXのモード変更のcppファイル [mode.cpp]
// Author : TENMA
//
//================================================================================================================
//*************************************************************************************************
//*** インクルードファイル ***
//*************************************************************************************************
#include "mode.h"
#include "Title.h"
#include "game.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
MODE g_mode = MODE_TITLE;								// 現在の画面

//==================================================================================
// --- タイトル関連cppファイルの初期化 ---
//==================================================================================
void InitMode(void)
{
	// 指定の画面(モード)の初期化処理
	switch (g_mode)
	{
		// タイトル画面
	case MODE_TITLE:
		InitTitle();
		break;

		// ゲーム画面
	case MODE_GAME:
		InitGame();
		break;
	}
}

//==================================================================================
// --- タイトル関連cppファイルの終了 ---
//==================================================================================
void UninitMode(void)
{
	// タイトル画面の終了処理
	UninitTitle();

	// ゲーム画面の終了処理
	UninitGame();
}

//==================================================================================
// --- タイトル関連cppファイルの更新 ---
//==================================================================================
void UpdateMode(void)
{
	switch (g_mode)
	{
		// タイトル画面
	case MODE_TITLE:
		UpdateTitle();
		break;

		// ゲーム画面
	case MODE_GAME:
		UpdateGame();
		break;
	}
}

//==================================================================================
// --- タイトル関連cppファイルの描画 ---
//==================================================================================
void DrawMode(void)
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	D3DVIEWPORT9 viewportDef;		// デフォルトビューポート

	// ビューポートの保存
	pDevice->GetViewport(&viewportDef);

	/*** 現在の画面(モード)の描画処理 ***/
	switch (g_mode)
	{
		// タイトル画面
	case MODE_TITLE:
		DrawTitle();
		break;

		// ゲーム画面
	case MODE_GAME:
		DrawGame();
		break;
	}

	/*** 現在の画面(モード)の描画処理 ***/
	switch (g_mode)
	{
		// ゲーム画面
	case MODE_GAME:
		DrawGameInstance();
		break;
	}

	// ビューポートの設定
	pDevice->SetViewport(&viewportDef);

	EndDevice();
}

//==================================================================================
// --- モード別のインスタンシング描画 ---
//==================================================================================
void DrawModeInstance(void)
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	D3DVIEWPORT9 viewportDef;		// デフォルトビューポート

	// ビューポートの保存
	pDevice->GetViewport(&viewportDef);

	/*** 現在の画面(モード)の描画処理 ***/
	switch (g_mode)
	{
		// ゲーム画面
	case MODE_GAME:
		DrawGameInstance();
		break;
	}

	// ビューポートの設定
	pDevice->SetViewport(&viewportDef);

	EndDevice();
}

//==================================================================================
// --- 画面の設定 ---
//==================================================================================
void SetMode(MODE mode)
{
	// 現在の画面(モード)の終了
	switch (g_mode)
	{
		// タイトル画面
	case MODE_TITLE:
		UninitTitle();
		break;

		// ゲーム画面
	case MODE_GAME:
		UninitGame();
		break;
	}

	// 指定の画面(モード)の初期化処理
	switch (mode)
	{
		// タイトル画面
	case MODE_TITLE:
		InitTitle();
		break;

		// ゲーム画面
	case MODE_GAME:
		InitGame();
		break;
	}

	// モードを保存
	g_mode = mode;
}

//==================================================================================
// --- 現在のモードを取得 ---
//==================================================================================
MODE GetMode(void)
{
	return g_mode;
}