//================================================================================================================
//
// DirectXのXファイル読み込み用ヘッダファイル [loadxfile.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _TEXTURE_H_
#define _TEXTURE_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define MAX_TEXTURE			(256)			// 読み込めるモデル数
#define ERROR_TEXTURE		(-1)			// テクスチャ読み込み失敗時の値

//*************************************************************************************************
//*** モデル情報構造体の定義 ***
//*************************************************************************************************
typedef struct TEXTURE_INFO
{
	LPDIRECT3DTEXTURE9 pTexture;	// テクスチャへのポインタ
	char aTexFileName[MAX_PATH];	// テクスチャファイル名
	bool bUse;						// 一度格納しようとしたか
	bool bSafe;						// 情報が格納されているか(参照可能か)
} TEXTURE_INFO;

typedef TEXTURE_INFO *LPTEXTURE_INFO;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitTexture(void);
void UninitTexture(void);
void ResetTexture(void);

HRESULT LoadTexture(_In_ const char* pTexFileName, int *pOutIdx);
LPDIRECT3DTEXTURE9 GetTexture(_In_ int nType);
#endif