//================================================================================================================
//
// DirectXのフェード用ヘッダファイル [Fade.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _FADE_H_
#define _FADE_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include "mode.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define NORMAL_FADECOUNT	(100)								// 通常のフェード時間
#define NORMAL_FADE			D3DXCOLOR(0.0f,0.0f,0.0f,0.0f)		// 通常の暗転フェード

//**********************************************************************************
//*** フェードの種類 ***
//**********************************************************************************
typedef enum
{
	FADE_NONE = 0,			// フェードなし
	FADE_IN,				// フェードイン
	FADE_OUT,				// フェードアウト
	FADE_MAX
}FADE;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitFade(MODE modeNext);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);

/// <summary>
/// 指定された種類のポリゴンで画面全体をフェードイン,アウトさせる関数です。
/// </summary>
/// <param name="modeNext">フェードアウト後に移行しているモード</param>
/// <param name="nCounterFade">フェードの時間</param>
void SetFade(MODE modeNext, int nCounterFade = NORMAL_FADECOUNT);

FADE GetFade(void);

#endif