//==================================================================================
//
// DirectXのゲーム関連用のcppファイル [game.cpp]
// Author : TENMA
//
//==================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "input.h"
#include "camera.h"
#include "fade.h"
#include "modeldata.h"
#include "3Dmodel.h"
#include "light.h"
#include "thread.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************

//**********************************************************************************
//*** グローバル変数 ***
//**********************************************************************************
int g_nIdx3DModel;		// 設置した3Dモデルのインデックス
int g_nIdxCamera;		// 設置したカメラのインデックス

//==================================================================================
// --- 初期化 ---
//==================================================================================
void InitGame(void)
{
	/*** Aの初期化 ***/

	/*** カメラの初期化 ***/
	InitCamera();

	/*** モデルデータの初期化 ***/
	InitModelData();

	/*** 3Dモデルの初期化 ***/
	Init3DModel();

	/*** ライトの初期化 ***/
	InitLight();

	/*** Xファイルの読み込み ***/
	int nIdxModelData;		// モデルデータへのインデックス
	if (SUCCEEDED(LoadModelData("data/MODEL/XmasTree.x", &nIdxModelData)))
	{
		// モデルデータ使用した3Dモデルの配置
		g_nIdx3DModel = Set3DModel(D3DXVECTOR3_NULL, D3DXVECTOR3_NULL, nIdxModelData);
	}

	D3DVIEWPORT9 viewport;

	// ビューポートの設定
	viewport.X = 0.0f;
	viewport.Y = 0.0f;
	viewport.Width = SCREEN_WIDTH;
	viewport.Height = SCREEN_HEIGHT;
	viewport.MinZ = 0.0f;
	viewport.MaxZ = 1.0f;

	// カメラの設置
	g_nIdxCamera = AddCamera(D3DXVECTOR3(0.0f, 75.0f, -300.0f),
		D3DXVECTOR3(0.0f, 0.0f, 0.0f),
		D3DXVECTOR3(0.0f, 0.0f, D3DX_HALFPI),
		viewport);

	Thread t;

	t.CreateThread(NULL, DEFAULT_PROC, false, NULL);
}

//==================================================================================
// --- 終了 ---
//==================================================================================
void UninitGame(void)
{
	/*** Aの終了 ***/

	/*** カメラの終了 ***/
	UninitCamera();

	/*** モデルデータの終了 ***/
	UninitModelData();

	/*** 3Dモデルの終了 ***/
	Uninit3DModel();

	/*** ライトの終了 ***/
	UninitLight();
}

//==================================================================================
// --- 更新 ---
//==================================================================================
void UpdateGame(void)
{
	// モード変更
	if (GetKeyboardTrigger(DIK_RETURN)
		|| GetJoypadTrigger(JOYKEY_A)
		|| GetJoypadTrigger(JOYKEY_START))
	{
		if (GetFade() == FADE_NONE)
		{
			SetFade(MODE_TITLE);
		}
	}

	/*** Aの更新 ***/

	/*** カメラの更新 ***/
	UpdateCamera(g_nIdxCamera);

	/*** 3Dモデルの更新 ***/
	Update3DModel();

	/*** ライトの更新 ***/
	UpdateLight();
}

//==================================================================================
// --- 描画 ---
//==================================================================================
void DrawGame(void)
{
	// カメラの数分だけ描画
	for (int nCntDraw = 0; nCntDraw < GetCameraNum(); nCntDraw++)
	{
		/*** カメラの設置 ***/
		SetCamera(nCntDraw);

		// VERTEX_3D ============================================
		/*** Aの描画 ***/

		/*** 3Dモデルの描画 ***/
		Draw3DModel();

		// VERTEX_2D ============================================
		/*** Aの描画 ***/
	}
}